app/views/home/index.html.erb

          <% count = 0 %>
          <% Item.all.each do |item| %>
---
SELECT "items".* FROM "items"