app/views/items/index.html.erb

  <div class="w3-row">
    <% Category.all.where(id: 1).each do |category| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1  [["id", 1]]

    <% end %>
    <% Category.all.where(id: 2).each do |category| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1  [["id", 2]]

    <% end %>
    <% Category.all.where(id: 3).each do |category| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1  [["id", 3]]

            <!-- /.col-lg-3 -->
            <% Item.all.where(category_id: 1).each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."category_id" = $1  [["category_id", 1]]

            <!-- /.col-lg-3 -->
            <% Item.all.where(category_id: 2).each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."category_id" = $1  [["category_id", 1]]

            <!-- /.col-lg-3 -->
            <% Item.all.where(category_id: 3).each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."category_id" = $1  [["category_id", 2]]