app/views/items/index.html.erb

            <!-- /.col-lg-3 -->
            <% Item.all.each do |item| %>
---
SELECT "items".* FROM "items"